In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'maths' : [80, 89, 90, 20],
    'science' : [40, 50, 90, 100],
    'language' : [20, 30, 90, 95]
})

In [3]:
df

   maths  science  language
0     80       40        20
1     89       50        30
2     90       90        90
3     20      100        95

In [4]:
df.loc[df.maths > 50, 'maths_1'] = 90

In [5]:
df

   maths  science  language  maths_1
0     80       40        20     90.0
1     89       50        30     90.0
2     90       90        90     90.0
3     20      100        95      NaN